#+TITLE: cite:moore2011nature: The nature of computation
#+ROAM_KEY: cite:moore2011nature

* Outline

In the course there are  5 units
- 1. Easy and Hard
- 2. Algorithms and Landscapes
- 3. P versus NP
- 4. Worst-case, Natural, and Random
- 5. Computation Everywhere

They will be released weekly and require at least 5 hours of effort.

The book has 15 chapters + 1 mathematical appendix; in a total of 945 pages.

The pattern matching of course with chapters is:

Unit 1: Chapters 1,2, 4 (parts of 4, at least)

Unit 2: Chapter 3

Unit 3: Chapters 4, 5, and 6

Unit 4: Spread throughout (Chapters 5 and 10 get at it, but it's not clear-cut)

Unit 5: Chapter 7

*Chapters 1-7 should be read in a linear order.*

#+BEGIN_SRC julia :results output
#=
(I should have used regex here)
(couldnt think of  a pure way of doing)
What do I want:
-(x1,x2)
-(x2,x3)
-(x3,x4)

Also, the mean and mode of this.
=#
using Distributions
let
    pages = [16, 20, 34, 60, 114, 146, 192, 242, 320, 370, 470, 526, 582, 670, 742, 838, 930 ];

    acc = [ ];

    function getdiff(x,y)
        push!(acc,y-x )
        return(y)
    end

    reduce(getdiff, pages);

    println("Size of each chapter \n $(acc)")
    println("median and mean chapter size $(median(acc))   $(mean(acc))  ")
end
#+END_SRC

#+RESULTS:
: Size of each chapter
:  Any[4, 14, 26, 54, 32, 46, 50, 78, 50, 100, 56, 56, 88, 72, 96, 92]
: median and mean chapter size 55.0   57.125

